const studentsDatabase = {
            "first": {
                "214": {
                    "name": "مازن خالد حماده عبدالرحمن السمخراطي",
                    "scores": {
                        
                  "اللغة العربية": 60,
      "اللغة الإنجليزية": 59,
      "الرياضيات": 59,
      "العلوم المتكامله": 60,
      "التاريخ": 59,
      "الجغرافيا": 58
                        
                        
                        
                        
                    }
                },
                "12346": {
                    "name": "فاطمة أحمد حسن",
                    "scores": {
                        "اللغة العربية": 19,
                        "اللغة الإنجليزية": 18,
                        "الرياضيات": 17,
                        "الفيزياء": 18,
                        "الكيمياء": 19,
                        "الأحياء": 18,
                        "التاريخ": 17,
                        "الجغرافيا": 19
                    }
                }
            },
            "second": {
                "scientific": {
                    
                    
                    
                    
                    
                   
  

   "30810011810434": {
    "name": "طارق عبد الناصر فهيم راغب ",
    "scores": {
      "اللغة العربية": 60,
      "اللغة الأجنبية الأولى": 49,
      "الرياضيات": 50,
      "الأحياء": 55,
      "الفيزياء": 45,
      "الكيمياء": 49
    }
   }


                    
                    
                },
                "literary": {
                    "34567": {
                        "name": "زينب محمد إبراهيم",
                        "scores": {
                            "اللغة العربية": 19,
                            "اللغة الإنجليزية": 18,
                            "التاريخ": 20,
                            "الجغرافيا": 19,
                            "الفلسفة": 18,
                            "علم النفس": 19,
                            "اللغة الفرنسية": 17
                        }
                    }
                }
            }
        };

       
