const studentsDatabase = {
            "first": {
                "214": {
                    "name": "مازن خالد حماده عبدالرحمن السمخراطي",
                    "scores": {
                        
                  "اللغة العربية": 60,
      "اللغة الإنجليزية": 59,
      "الرياضيات": 59,
      "العلوم المتكامله": 60,
      "التاريخ": 59,
      "الجغرافيا": 58
                        
                        
                        
                        
                    }
                },
                "12346": {
                    "name": "فاطمة أحمد حسن",
                    "scores": {
                        "اللغة العربية": 19,
                        "اللغة الإنجليزية": 18,
                        "الرياضيات": 17,
                        "الفيزياء": 18,
                        "الكيمياء": 19,
                        "الأحياء": 18,
                        "التاريخ": 17,
                        "الجغرافيا": 19
                    }
                }
            },
            "second": {
                "scientific": {
                    
                    
                    
                    
                    
                   
  "30809162100333": {
    "name": "يوسف خالد جابر ابرايم",
    "scores": {
      "اللغة العربية": 70,
      "اللغة الأجنبية الأولى": 50,
      "الرياضيات": 40,
      "الأحياء": 45,
      "الفيزياء": 40,
      "الكيمياء": 55
    }
  },
  "513": {
    "name": "احمد رمضان حلمي سالم",
    "scores": {
      "اللغة العربية": 70,
      "اللغة الأجنبية الأولى": 55,
      "الرياضيات": 43,
      "الأحياء": 40,
      "الفيزياء": 40,
      "الكيمياء": 35
    }
  
},


 "678": {
    "name": "مؤمن أحمد مسعد أحمد",
    "scores": {
      "اللغة العربية": 65,
      "اللغة الأجنبية الأولى": 51,
      "الرياضيات": 53,
      "الأحياء": 55,
      "الفيزياء": 56,
      "الكيمياء": 53
    }
  },"616": {
    "name": "فارس شريف حمدى الدسوقي الزنقراني",
    "scores": {
      "اللغة العربية": 66,
      "اللغة الأجنبية الأولى": 53,
      "الرياضيات": 55,
      "الأحياء": 54,
      "الفيزياء": 50,
      "الكيمياء": 53
    }
 },"690": {
    "name": "ناجي سليمان ناجي فنيار ",
    "scores": {
      "اللغة العربية": 70,
      "اللغة الأجنبية الأولى": 52,
      "الرياضيات": 49,
      "الأحياء": 55,
      "الفيزياء": 51,
      "الكيمياء": 53
    }
 }

                            


                    
                    
                },
                "literary": {
                    "34567": {
                        "name": "زينب محمد إبراهيم",
                        "scores": {
                            "اللغة العربية": 19,
                            "اللغة الإنجليزية": 18,
                            "التاريخ": 20,
                            "الجغرافيا": 19,
                            "الفلسفة": 18,
                            "علم النفس": 19,
                            "اللغة الفرنسية": 17
                        }
                    }
                }
            }
        };

       
